STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_zigbee.c
  return( ZB_MSG_CONTINUE );
}

/*************************************************************
 *
 * GENERIC FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Callback that indicate if a 'Permit to Join' the network can be done
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ZbZdoPermitJoinReqCallback( struct ZbZdoPermitJoinRspT * pstJoinResponse, void * arg )
{
  UNUSED( arg );

  if ( pstJoinResponse->status != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error, cannot set Permit Join duration (%d)", pstJoinResponse->status );
  }
  else
  {
    LOG_INFO_APP( "Permit Join duration successfully changed." );
  }
}

/**
 * @brief  Send the request to NWK layer a Permit to Join the network
 * @param  cPermitJoinDelay   Delay in second during the new Permit to Join is available
 * @retval None
 */
void APP_ZIGBEE_PermitJoin( uint8_t cPermitJoinDelay )
{
  struct ZbZdoPermitJoinReqT  stJoinRequest;
  enum ZbStatusCodeT          eStatus;

  memset( &stJoinRequest, 0, sizeof( stJoinRequest ) );
  stJoinRequest.destAddr = ZB_NWK_ADDR_UNDEFINED;
  stJoinRequest.tcSignificance = true;
  stJoinRequest.duration = cPermitJoinDelay;

  LOG_INFO_APP( "Send command Permit Join during %ds", cPermitJoinDelay );
  eStatus = ZbZdoPermitJoinReq( stZigbeeAppInfo.pstZigbee, &stJoinRequest, APP_ZIGBEE_ZbZdoPermitJoinReqCallback, NULL);
  if ( eStatus != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error during command Permit Join (%d)", eStatus );
  }
}

/**
 * @brief  Indicate if Application as already join the network
 * @param  None
 * @retval True if Join OK, else False
 */
bool APP_ZIGBEE_IsAppliJoinNetwork( void )
{
  bool                bJoinOk = false;
  uint64_t            dlEpid = 0U;
  enum ZbStatusCodeT  eZbStatus;

  if ( stZigbeeAppInfo.pstZigbee != NULL )
  {
    /* Check if the router joined the network, and if the waiting time after the Join is finished */
    eZbStatus = ZbNwkGet( stZigbeeAppInfo.pstZigbee, ZB_NWK_NIB_ID_ExtendedPanId, &dlEpid, sizeof( dlEpid ) );
    if ( ( eZbStatus == ZB_STATUS_SUCCESS) && ( dlEpid != 0u ) && ( stZigbeeAppInfo.eJoinStatus == ZB_STATUS_SUCCESS ) )
      { bJoinOk = true; }
  }

  return( bJoinOk );
}

/**
 * @brief   Indicate a Device with Install Code request a Join.
 *          Add the LinkKey (from Install Code) on List and start a Join during 30s.
 *
 * @param   dlExtendedAddress   Device Extended Address
 * @param   szInstallCode       Device Install Code
 * @param   cPermitJoinDelay    Time to Device to Join network. If 0, PermitJoin is not called.
 */
void APP_ZIGBEE_AddDeviceWithInstallCode( uint64_t dlExtendedAddress, uint8_t * szInstallCode, uint8_t cPermitJoinDelay )
{
  uint32_t                  lTcPolicy = 0;
  struct ZbApsmeAddKeyReqT  stAddKeyReq;
  struct ZbApsmeAddKeyConfT stAddKeyConf;
  static  bool              bTrustCenterDone = false;

  if ( bTrustCenterDone == false )
  {
    ZbApsGet( stZigbeeAppInfo.pstZigbee, ZB_APS_IB_ID_TRUST_CENTER_POLICY, &lTcPolicy, sizeof(lTcPolicy));
    lTcPolicy |= (ZB_APSME_POLICY_IC_SUPPORTED | ZB_APSME_POLICY_TCLK_UPDATE_REQUIRED | ZB_APSME_POLICY_TC_POLICY_CHANGE);

    ZbApsSet( stZigbeeAppInfo.pstZigbee, ZB_APS_IB_ID_TRUST_CENTER_POLICY, &lTcPolicy, sizeof(lTcPolicy) );
    bTrustCenterDone = true;
  }

  /* Register 'Application Link Key' for the Device */
  memset( &stAddKeyConf, 0, sizeof( stAddKeyConf ) );
  memset( &stAddKeyReq, 0, sizeof( stAddKeyReq ) );

  stAddKeyReq.keyType = ZB_SEC_KEYTYPE_TC_LINK;
  stAddKeyReq.keySeqNumber = 0;
  stAddKeyReq.partnerAddr = dlExtendedAddress;

  /*Extract Link Key from the Install Code*/
  ZbAesMmoHash( szInstallCode, ( ZB_SEC_KEYSIZE + 2u ), stAddKeyReq.key );

  /* Add the new Link Key */
  ZbApsmeAddKeyReq( stZigbeeAppInfo.pstZigbee, &stAddKeyReq, &stAddKeyConf );
  if ( stAddKeyConf.status != ZB_STATUS_SUCCESS )
  {
    LOG_ERROR_APP( "Error Add Link Key (0x%02X)", stAddKeyConf.status );
  }
  else
  {
    LOG_INFO_APP( "Add of Device Link Key OK." );
    if ( cPermitJoinDelay != 0 )
    {
      APP_ZIGBEE_PermitJoin( cPermitJoinDelay );
      LOG_INFO_APP( "Device can now Join Network during %d seconds.", cPermitJoinDelay );
    }
  }
}

/**
 * @brief  Get the number of entries in Binding Table and display it if needed.
 *
 * @param  bDisplay   Indicate if display Table informations (true) or not (false)
 * @retval Number of entries
 */
uint16_t APP_ZIGBEE_GetDisplayBindTable( bool bDisplay )
{
  bool                  bEndDone = false;
  uint16_t              iIndex = 0, iCount = 0;
  struct ZbApsmeBindT   stBindEntry;
  enum ZbStatusCodeT    eStatus;

  if ( bDisplay != false )
  {
    LOG_INFO_APP( "[FIND-BIND] Printing Binding table below:" );
    LOG_INFO_APP( "  Item | ClusterId | Dest. Ext. Address | Dst EP | Src EP |" );
    LOG_INFO_APP( "  -----|-----------|--------------------|--------|--------|" );
  }

  /* Go through each elements */
  do
  {
    /* Check the end of the table */
    eStatus = ZbApsGetIndex( stZigbeeAppInfo.pstZigbee, ZB_APS_IB_ID_BINDING_TABLE, &stBindEntry, sizeof(stBindEntry), iIndex );
    if ( eStatus != ZB_APS_STATUS_SUCCESS)
    {
      if ( eStatus != ZB_APS_STATUS_INVALID_INDEX )
      {
        LOG_ERROR_APP( "ERROR ! ZbApsGetIndex failed (0x%02X)", eStatus );
      }
      bEndDone = true;
    }
    else
    {
      /* If empty, ignore */
      if ( stBindEntry.srcExtAddr != 0u )
      {
        if ( bDisplay != false )
        {
          /* Display element */
          LOG_INFO_APP( "   %2d  |   0x%03X   | " LOG_DISPLAY64() " |  0x%02X  |  0x%02X  |", iIndex, stBindEntry.clusterId,
                        LOG_NUMBER64(stBindEntry.dst.extAddr), stBindEntry.dst.endpoint, stBindEntry.srcEndpt );
        }
        iCount++;
      }
    }
    iIndex++;
  }
  while ( bEndDone == false );

  if ( bDisplay != false )
  {
    LOG_INFO_APP( "  Found %d Binds", iCount );
  }

  return iCount;
}

/**
 * @brief  Get the current RF channel
 * @param  cCurrentChannel    Current Channel
 * @retval True if Ok, else false.
 */
bool APP_ZIGBEE_GetCurrentChannel( uint8_t * cCurrentChannel )
{
  bool      bResult = false;
  uint8_t   cChannel = 0 ;
  uint32_t  lChannelmask;
  struct ZbNlmeGetInterfaceReqT   stZbNlmeRequest;
  struct ZbNlmeGetInterfaceConfT  stZbNlmeConfig;

  /* Verify if Appli has already Join a Network  */
  if ( APP_ZIGBEE_IsAppliJoinNetwork() != false )
  {
    /* NLME-GET-INTERFACE.request on Interface 0 */
    memset( &stZbNlmeRequest, 0, sizeof( stZbNlmeRequest ) );
    memset( &stZbNlmeConfig, 0, sizeof( stZbNlmeConfig ) );

    stZbNlmeRequest.ifcIndex = 0;

    ZbNlmeGetInterface( stZigbeeAppInfo.pstZigbee, &stZbNlmeRequest, &stZbNlmeConfig);
    if ( stZbNlmeConfig.status == ZB_STATUS_SUCCESS )
    {
      /* Current channel */
      lChannelmask = stZbNlmeConfig.channelInUse;
      while ( ( lChannelmask & 1u ) == 0u )
      {
        /* Iterate through bits until we find the only set bit */
        lChannelmask = lChannelmask >> 1u;
        cChannel++;
      }

